In [1]:
import pandas as pd
import numpy as np

## eksik veri

In [3]:
sozlukVerisi = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame =pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

Olmayan veriler : NaN

In [5]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

burda nan olan bir değer varsa onun olduğu tüm satırı siler

In [13]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [14]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [15]:
yeniVeri = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[30,np.nan,np.nan]}
yeniDataFrame =pd.DataFrame(yeniVeri)

In [16]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     30.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [17]:
#birden fazla nan olanlar için:
yeniDataFrame.dropna(axis=1,thresh =2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

Antalya silinir çünkü 2 ve daha fazla olanllar silinsin dedik

NOT: aynı şeyleri satırlar için de yaparız

In [18]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     30.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

fillna : boş olanları doldurur

## groupby

In [19]:
maasSozluk = {"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
             "Calisan Ismi": ["Gaye","Hakan","Zeynep","Hasan","Ertu","Gamze"],
             "Maas":[100,200,300,400,500,600]}

In [20]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [21]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım         Gaye   100
1    Yazılım        Hakan   200
2  Pazarlama       Zeynep   300
3  Pazarlama        Hasan   400
4      Hukuk         Ertu   500
5      Hukuk        Gamze   600

In [22]:
grouplanmisDF = maasDataFrame.groupby("Departman")

In [23]:
grouplanmisDF

In [25]:
grouplanmisDF.count()  #departmanda kaç kişi çalışıyor

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [34]:
grouplanmisDF.mean("Maas")

            Maas
Departman
Hukuk      550.0
Pazarlama  350.0
Yazılım    150.0

In [35]:
grouplanmisDF.min() #deparman bazlı: lgili departmanın en az maaş alan isimleri

          Calisan Ismi  Maas
Departman
Hukuk             Ertu   500
Pazarlama        Hasan   300
Yazılım           Gaye   100

In [36]:
grouplanmisDF.max()

          Calisan Ismi  Maas
Departman
Hukuk            Gamze   600
Pazarlama       Zeynep   400
Yazılım          Hakan   200

In [37]:
grouplanmisDF.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
Pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
Yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0